INSERT INTO public.users (login, password, activation_code, email, fio, birthdate, status, role, active)
VALUES ('admin',
        '$2a$10$UV08SIQ..KX8R429dwcVRukKTg1JyB31ZdJjNIWUN8Ltmc6jkyh8a',
        null,
        'bekas2003@mail.ru',
        null,
        null,
        null,
        'ADMIN',
        true);

INSERT INTO public.groups (name_group)
VALUES ('А-05-21'),
       ('А-06-21'),
       ('А-07-21'),
       ('А-08-21'),
       ('А-14-21'),
       ('А-16-21'),
       ('А-05-22'),
       ('А-06-22'),
       ('А-07-22'),
       ('А-08-22'),
       ('А-14-22'),
       ('А-16-22'),
       ('А-05-23'),
       ('А-06-23'),
       ('А-07-23'),
       ('А-08-23'),
       ('А-14-23'),
       ('А-16-23'),
       ('А-05-24'),
       ('А-06-24'),
       ('А-07-24'),
       ('А-08-24'),
       ('А-14-24'),
       ('А-16-24');

INSERT INTO public.discipline (name_discipline)
VALUES ('Математический анализ'),
       ('Линейная алгебра'),
       ('Дискретная математика'),
       ('Теория вероятностей'),
       ('Вычислительная математика'),
       ('Физика'),
       ('Химия'),
       ('Экология'),
       ('Теоретическая механика'),
       ('Информатика'),
       ('Программирование'),
       ('Базы данных'),
       ('Компьютерные сети'),
       ('Архитектура ЭВМ'),
       ('Электротехника'),
       ('Философия'),
       ('История'),
       ('Иностранный язык'),
       ('Культурология'),
       ('Правоведение'),
       ('Основы безопасности жизнедеятельности'),
       ('Экономика'),
       ('Менеджмент'),
       ('Физическая культура'),
       ('Прикладная физическая культура');

INSERT INTO public.status_task (status)
VALUES ('Создано'),
       ('Просрочено'),
       ('На проверке'),
       ('Требует доработки'),
       ('Выполнено');

INSERT INTO public.lesson_type (type)
VALUES ('Лекция'),
       ('Семинар'),
       ('Лабораторная');

INSERT INTO public.pair (start, finish)
VALUES ('09:20:00', '10:55:00'),
       ('11:10:00', '12:45:00'),
       ('13:45:00', '15:20:00'),
       ('15:35:00', '17:10:00'),
       ('17:15:00', '18:45:00');